aurabindo/nrf5-oled-ssd1306/ssd1306.c
    // x is which column
    switch (color) {
    case WHITE:
        buffer[x + (y / 8)*SSD1306_LCDWIDTH] |=  (1 << (y & 7));
        break;
    case BLACK:
        buffer[x + (y / 8)*SSD1306_LCDWIDTH] &= ~(1 << (y & 7));
        break;
    case INVERSE:
        buffer[x + (y / 8)*SSD1306_LCDWIDTH] ^=  (1 << (y & 7));
        break;
    }
}


void ssd1306_invert_display(uint8_t i)
{
    if (i) {
        ssd1306_command(SSD1306_INVERTDISPLAY);
    }
    else {
        ssd1306_command(SSD1306_NORMALDISPLAY);
    }
}


// startscrollright
// Activate a right handed scroll for rows start through stop
// Hint, the display is 16 rows tall. To scroll the whole display, run:
// display.scrollright(0x00, 0x0F)
void ssd1306_start_scroll_right(uint8_t start, uint8_t stop)
{
    ssd1306_command(SSD1306_RIGHT_HORIZONTAL_SCROLL);
    ssd1306_command(0X00);
    ssd1306_command(start);
    ssd1306_command(0X00);
    ssd1306_command(stop);
    ssd1306_command(0X00);
    ssd1306_command(0XFF);
    ssd1306_command(SSD1306_ACTIVATE_SCROLL);
}

// startscrollleft
// Activate a right handed scroll for rows start through stop
// Hint, the display is 16 rows tall. To scroll the whole display, run:
// display.scrollright(0x00, 0x0F)
void ssd1306_start_scroll_left(uint8_t start, uint8_t stop)
{
    ssd1306_command(SSD1306_LEFT_HORIZONTAL_SCROLL);
    ssd1306_command(0X00);
    ssd1306_command(start);
    ssd1306_command(0X00);
    ssd1306_command(stop);
    ssd1306_command(0X00);
    ssd1306_command(0XFF);
    ssd1306_command(SSD1306_ACTIVATE_SCROLL);
}

// startscrolldiagright
// Activate a diagonal scroll for rows start through stop
// Hint, the display is 16 rows tall. To scroll the whole display, run:
// display.scrollright(0x00, 0x0F)
void ssd1306_start_scroll_diag_right(uint8_t start, uint8_t stop)
{
    ssd1306_command(SSD1306_SET_VERTICAL_SCROLL_AREA);
    ssd1306_command(0X00);
    ssd1306_command(SSD1306_LCDHEIGHT);
    ssd1306_command(SSD1306_VERTICAL_AND_RIGHT_HORIZONTAL_SCROLL);
    ssd1306_command(0X00);
    ssd1306_command(start);
    ssd1306_command(0X00);
    ssd1306_command(stop);
    ssd1306_command(0X01);
    ssd1306_command(SSD1306_ACTIVATE_SCROLL);
}

// startscrolldiagleft
// Activate a diagonal scroll for rows start through stop
// Hint, the display is 16 rows tall. To scroll the whole display, run:
// display.scrollright(0x00, 0x0F)
void ssd1306_start_scroll_diag_left(uint8_t start, uint8_t stop)
{
    ssd1306_command(SSD1306_SET_VERTICAL_SCROLL_AREA);
    ssd1306_command(0X00);
    ssd1306_command(SSD1306_LCDHEIGHT);
    ssd1306_command(SSD1306_VERTICAL_AND_LEFT_HORIZONTAL_SCROLL);
    ssd1306_command(0X00);
    ssd1306_command(start);
    ssd1306_command(0X00);
    ssd1306_command(stop);
    ssd1306_command(0X01);
    ssd1306_command(SSD1306_ACTIVATE_SCROLL);
}

void ssd1306_stop_scroll(void)
{
    ssd1306_command(SSD1306_DEACTIVATE_SCROLL);
}

// Dim the display
// dim = true: display is dimmed
// dim = false: display is normal
void ssd1306_dim(bool dim)
{
    uint8_t contrast;

    if (dim) {
        contrast = 0; // Dimmed display
    }
    else {
        if (_vccstate == SSD1306_EXTERNALVCC) {
            contrast = 0x9F;
        }
        else {
            contrast = 0xCF;
        }
    }
    // the range of contrast to too small to be really useful
    // it is useful to dim the display
    ssd1306_command(SSD1306_SETCONTRAST);
    ssd1306_command(contrast);
}

void ssd1306_data(uint8_t c)
{
    if (use_i2c) {
        ret_code_t ret;
        uint8_t dta_send[] = {0x40, c};
        ret = nrf_drv_twi_tx(&m_twi_master, _i2caddr, dta_send, 2, false);
        APP_ERROR_CHECK(ret);
    }
    else {
        _HI_CS();
        _HI_DC();
        _LO_CS();
        UNUSED_VARIABLE(spi_transfer(&c, 1));
        _HI_CS();
    }
}

void ssd1306_display(void)
{
    uint32_t err_code;
/*    ssd1306_command(SSD1306_SETLOWCOLUMN | 0x0);  // low col = 0
	ssd1306_command(SSD1306_SETHIGHCOLUMN | 0x0);  // hi col = 0*/
	ssd1306_command(SSD1306_SETSTARTLINE | 0x0); // line #0
    ssd1306_command(SSD1306_COLUMNADDR);
    ssd1306_command(0);   // Column start address (0 = reset)
    // ssd1306_command(SSD1306_LCDWIDTH - 1); // Column end address (127 = reset)
    ssd1306_command(0x7F); // Column end address (127 = reset)

    ssd1306_command(SSD1306_PAGEADDR);
    ssd1306_command(0); // Page start address (0 = reset)
    ssd1306_command(3); // Page end address for 128x32 */
/*#if SSD1306_LCDHEIGHT == 64
    ssd1306_command(7); // Page end address
#endif
#if SSD1306_LCDHEIGHT == 32
    ssd1306_command(3); // Page end address
#endif
#if SSD1306_LCDHEIGHT == 16
    ssd1306_command(1); // Page end address
#endif*/

    if (use_i2c) {
        uint8_t control = 0x40;
        uint8_t data_chunk [17];
        data_chunk[0] = control;

        for (uint8_t i=0; i<32; i++) {
            for (uint16_t j=0; j< 16; j++) {
                // data_chunk[1+j] = buffer[(32*(32 - i%32)) + j];
                data_chunk[1+j] = buffer[32*i + j];
            }
            err_code = nrf_drv_twi_tx(&m_twi_master, _i2caddr, data_chunk, (uint8_t) (sizeof(data_chunk)) , false);
            APP_ERROR_CHECK(err_code);

        }
        // err_code = nrf_drv_twi_tx(&m_twi_master, _i2caddr, &control, 3)]
        // err_code = nrf_drv_twi_tx(&m_twi_master, _i2caddr, &control, 1, true);
        // APP_ERROR_CHECK(err_code);
        // SEGGER_RTT_WriteString(0,"Sent control 0x40\n");
        // err_code = nrf_drv_twi_tx(&m_twi_master, _i2caddr, buffer, (uint8_t) (SSD1306_LCDWIDTH * SSD1306_LCDHEIGHT / 8) , true);
        // APP_ERROR_CHECK(err_code);
        // nrf_drv_twi_xfer_desc_t xfer_desc =
            // NRF_DRV_TWI_XFER_DESC_TX(_i2caddr, buffer, (uint8_t) (SSD1306_LCDWIDTH * SSD1306_LCDHEIGHT / 8));
            // NRF_DRV_TWI_XFER_DESC_TX(_i2caddr, buffer, (uint8_t) (128));
        // err_code = nrf_drv_twi_xfer(&m_twi_master, &xfer_desc, NRF_DRV_TWI_FLAG_TX_POSTINC);
        // APP_ERROR_CHECK(err_code);

        /*
        for (uint16_t i = 0; i < (SSD1306_LCDWIDTH * SSD1306_LCDHEIGHT / 8) - 1; i++) {
                err_code = nrf_drv_twi_tx(&m_twi_master, _i2caddr, buffer +  i, (uint8_t) (1), true);
                APP_ERROR_CHECK(err_code);
        }
        */
/*            SEGGER_RTT_WriteString(0,"Sending last data\n");
            err_code = nrf_drv_twi_tx(&m_twi_master, _i2caddr, buffer - 1 + (SSD1306_LCDWIDTH *                                                     SSD1306_LCDHEIGHT / 8), (uint8_t) (1), false);
            APP_ERROR_CHECK(err_code);
            SEGGER_RTT_WriteString(0,"Sent data\n");*/
    }
    else {
        _HI_CS();
        _HI_DC();
        _LO_CS();
        for (uint16_t i = 0; i < (SSD1306_LCDWIDTH * SSD1306_LCDHEIGHT / 8); i++) {
            //UNUSED_VARIABLE(spi_transfer(&buffer[i], 1));
        }
        _HI_CS();
    }
}

// clear everything
void ssd1306_clear_display(void)
{
    memset(buffer, 0, (SSD1306_LCDWIDTH * SSD1306_LCDHEIGHT / 8));
}



void ssd1306_draw_fast_hline(int16_t x, int16_t y, int16_t w, uint16_t color)
{
    bool __swap = false;
    switch (rotation) {
    case 0:
        // 0 degree rotation, do nothing
        break;
    case 1:
        // 90 degree rotation, swap x & y for rotation, then invert x
        __swap = true;
        ssd1306_swap(x, y);
        x = WIDTH - x - 1;
        break;
    case 2:
        // 180 degree rotation, invert x and y - then shift y around for height.
        x = WIDTH - x - 1;
        y = HEIGHT - y - 1;
        x -= (w - 1);
        break;
    case 3:
        // 270 degree rotation, swap x & y for rotation, then invert y  and adjust y for w (not to become h)
        __swap = true;
        ssd1306_swap(x, y);
        y = HEIGHT - y - 1;
        y -= (w - 1);
        break;
    }

    if (__swap) {
        ssd1306_draw_fast_vline_internal(x, y, w, color);
    }
    else {
        ssd1306_draw_fast_hline_internal(x, y, w, color);
    }
}

