aurabindo/nrf5-oled-ssd1306/ssd1306.c
void ssd1306_set_textwrap(bool w)
{
    wrap = w;
}

uint8_t ssd1306_get_rotation(void)
{
    return rotation;
}

void ssd1306_set_rotation(uint8_t x)
{
    rotation = (x & 3);
    switch (rotation) {
    case 0:
    case 2:
        _width  = WIDTH;
        _height = HEIGHT;
        break;
    case 1:
    case 3:
        _width  = HEIGHT;
        _height = WIDTH;
        break;
    }
}

// Enable (or disable) Code Page 437-compatible charset.
// There was an error in glcdfont.c for the longest time -- one character
// (#176, the 'light shade' block) was missing -- this threw off the index
// of every character that followed it.  But a TON of code has been written
// with the erroneous character indices.  By default, the library uses the
// original 'wrong' behavior and old sketches will still work.  Pass 'true'
// to this function to use correct CP437 character values in your code.
void ssd1306_cp437(bool x)
{
    _cp437 = x;
}


void ssd1306_putstring(char* buffer)
{
    while (*buffer) {
        ssd1306_write((uint8_t)*buffer);
        buffer++;
    }
}

void ssd1306_puts(char* buffer)
{
    ssd1306_putstring(buffer);
    ssd1306_write('\n');
}



void ssd1306_fill_ff() {
    memset(buffer, 0xff, SSD1306_LCDHEIGHT * SSD1306_LCDWIDTH /8);
}

void ssd1306_fill_00() {
    memset(buffer, 0x00, SSD1306_LCDHEIGHT * SSD1306_LCDWIDTH /8);
}

void ssd1306_fill_own() {
    for (uint16_t i = 0; i < 1024; i++) {
        buffer[i] = 0xff;
        ssd1306_display();
        // nrf_delay_ms(1);
    }
}